erpdev.СХК_Расширение/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5f80ee1-11ee-4805-9a52-c7edb03a422e">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="695d5be0-2491-490f-9689-78e3615b85de">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="9c3a50fe-c553-436b-9ff3-29e6bf5abe55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ba4dab77-7956-4903-8aff-17c9e06ea5fa">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Catalogs/СоглашенияСКлиентами/СоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СоглашенияСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="14aad1ae-407a-4ed5-8417-cc8f3b92276b">
    <name>ДоступноВнешнимПользователям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f915e376-cddf-4c97-b0e9-58faa01f613e">
    <name>ГрафикОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eee94500-3a3b-4350-b70c-1803cadd5feb">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="063b992f-9548-40b4-8871-64d13ab83972">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e1330337-0e4f-4343-bae1-088f3364b271">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bea6621c-3c92-4820-b203-0150e31cfd36">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4edd52ed-538d-4043-b97d-3c042b87263f">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fa901d6b-4829-42c4-98e4-38efb07896f9">
    <name>Типовое</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bd348c8-d0a6-496c-a962-363c1cd4769d">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1c557a08-a198-42cc-b04b-1e4babf5ae8f">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d3738188-3393-4738-af0a-62adc67a41f0">
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dcbb4334-893e-49e2-8da5-9dbf6889810f">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bae02e8b-e75f-46c9-8273-9cb447cc816d">
    <name>Регулярное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eeee5ed8-fcd7-4f81-acd0-b8dcc82fa1f7">
    <name>СегментНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18c066fd-27e4-47b3-9fef-34eb14cd9757">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="440adb56-326a-47ee-9a81-3ffcd528e6b4">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b78f7b3-eb87-4c96-90ff-0bc474c0b981">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0249bef8-62d9-4f0e-ad44-6ee1998ff21d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd8d77c6-c267-4a09-8b00-5a0e1bb814f9">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e14786e0-80eb-4a9c-924b-9b4ad8de1e32">
    <name>СегментПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a58cd9f-7130-4564-86da-092f8ae43740">
    <name>ИспользуетсяВРаботеТорговыхПредставителей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="433a6518-3733-4970-83e9-7ea3c53290bc">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/CommonModules/__СП_ЗаказКлиента/Module.bsl
&НаСервере
Процедура УстановитьУсловноеОформлениеАктуальностьЦен(Объект, УсловноеОформление, Элементы) Экспорт 
//++ plotnikov@syspod.ru #85606	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();  
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы["Товары"].Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЦенаСогласована");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	ОтборЭлемента.Использование = Истина;
	
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Розовый);

//-- plotnikov@syspod.ru #85606	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкуПравильнаяЦена(Объект) Экспорт
	//++ plotnikov@syspod.ru #85606
	ТаблицаТовары = Объект.Товары;
	Для Каждого Строка Из ТаблицаТовары Цикл
		
		ПравильнаяЦена = ПолучитьПравильнуюЦену(Объект, Строка.Номенклатура, Строка.ВидЦены);
		
		Строка.ЦенаИзСоглашения = ПравильнаяЦена;
		
		Если Строка.ЦенаИзСоглашения = Строка.Цена Тогда
			//или Строка.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка() Тогда
				Строка.ЦенаСогласована = Истина;
		КонецЕсли;
		
	КонецЦикла;
	//-- plotnikov@syspod.ru #85606
КонецПроцедуры

&НаСервере
Функция ПолучитьПравильнуюЦену(Объект, Номенклатура, ВидЦены)
	//++ plotnikov@syspod.ru #85606
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ВРЕМЕННЫЙ.Ссылка КАК СсылкаСоглашения,
	               |	ВРЕМЕННЫЙ.ВидЦен КАК ВидЦен,
	               |	Цены.Номенклатура КАК Номенклатура,
	               |	Цены.Цена КАК Цена,
	               |	Цены.Период КАК Период
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СК.Ссылка КАК Ссылка,
	               |		СК.ВидЦен КАК ВидЦен
	               |	ИЗ
	               |		Справочник.СоглашенияСКлиентами КАК СК
	               |	ГДЕ
	               |		СК.Ссылка = &Соглашение) КАК ВРЕМЕННЫЙ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЦН.ВидЦены КАК ВидЦен,
	               |			ЦН.Номенклатура КАК Номенклатура,
	               |			ЦН.Цена КАК Цена,
	               |			ЦН.Период КАК Период
	               |		ИЗ
	               |			РегистрСведений.ЦеныНоменклатуры КАК ЦН
	               |		ГДЕ
	               |			ЦН.Номенклатура = &Номенклатура
	               |			И НАЧАЛОПЕРИОДА(ЦН.Период, ДЕНЬ) <= &ДатаДокумента
	               |			И НАЧАЛОПЕРИОДА(ЦН.Период, ДЕНЬ) В
	               |					(ВЫБРАТЬ
	               |						МАКСИМУМ(НАЧАЛОПЕРИОДА(ЦН2.Период, ДЕНЬ))
	               |					ИЗ
	               |						РегистрСведений.ЦеныНоменклатуры КАК ЦН2
	               |					ГДЕ
	               |						ЦН2.Номенклатура = ЦН.Номенклатура
	               |						И ЦН2.ВидЦены = ЦН.ВидЦены
	               |						И НАЧАЛОПЕРИОДА(ЦН2.Период, ДЕНЬ) <= &ДатаДокумента)) КАК Цены
	               |		ПО ВРЕМЕННЫЙ.ВидЦен = Цены.ВидЦен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВРЕМЕННЫЙ.Ссылка,
	               |	ВРЕМЕННЫЙ.ВидЦен,
	               |	Цены.Номенклатура,
	               |	Цены.Цена,
	               |	Цены.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
	
	Результат =  Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Если Результат[0].Цена = NULL Тогда
			Результат[0].Цена = 0;	
		КонецЕсли;
		
		Возврат Результат[0].Цена;
	Иначе
		Возврат 0;
		
	КонецЕсли;
	
//-- plotnikov@syspod.ru #85606	
КонецФункции

&НаСервере
Процедура ПроверитьУстановкуЦен(Объект, РежимЗаписи, Отказ)
	//++ plotnikov@syspod.ru #85606
	Товары = Объект.Товары;
	НеСогласованые = Новый Массив;
	
	Для Каждого Строка Из Товары Цикл
		
		Если Строка.ЦенаСогласована = Ложь Тогда
			
			СтрНеСогласованые = Новый Структура("Номенклатура, Цена, ЦенаИзСоглашения");
			СтрНеСогласованые.Номенклатура = Строка.Номенклатура;
			СтрНеСогласованые.Цена = Строка.Цена;
			СтрНеСогласованые.ЦенаИзСоглашения = Строка.ЦенаИзСоглашения;
			
			НеСогласованые.Добавить(СтрНеСогласованые);

		КонецЕсли;
		
	КонецЦикла;
	
	Если НеСогласованые.Количество() > 0 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Сообщить("Нужно согласовать следующие позации номенклатуры: ");
			Для Каждого Позиция Из НеСогласованые Цикл
				Сообщить(Строка(Позиция.Номенклатура) + "; Цена: " + Строка(Позиция.Цена) + "; Цена из соглашения: " + Строка(Позиция.ЦенаИзСоглашения));	
			КонецЦикла;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//-- plotnikov@syspod.ru #85606
	
КонецПроцедуры

&НаСервере
Процедура __УстановкаПравильнойЦеныВЗаказКлиентаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//++ plotnikov@syspod.ru #85606
	Если СтрНайти(Источник.Комментарий, "Контур-EDI") > 0 Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Запись
			Или РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			ЗаполнитьКолонкуПравильнаяЦена(Источник);
			
			ПроверитьУстановкуЦен(Источник, РежимЗаписи, Отказ);
			
		КонецЕсли;
	КонецЕсли;
	//-- plotnikov@syspod.ru #85606	
КонецПроцедуры
